;;;; class-spring.lisp

(in-package #:mnas-spring)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;; d-o		-	наружный диаметр пружины;
;;; d-m 	-	средний диаметр пружины;
;;; d-w 	-	диаметр проволоки;
;;; l-0		-	Высота пружины в свободном состоянии;
;;; l_1		-	
;;; l_2		-	
;;; n		-	число рабочих витков пружины;
;;; n-f		-	полное число витков пружины;
;;; l-w 	-	длина проволоки развернутой пружины;
;;; t_пр	-	шаг пружины в свободном состоянии;
;;; h_пр	-	рабочий ход пружины;
;;; ro_пр	-	плотность материала пружины;
;;; m_пр	-	масса пружины;
;;; l_i		-	Высота пружины под нагрузкой;



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defparameter *s* (make-instance 'spring))

